**`commonimages/base/rhel_6_10`** terragrunt plan on `pull_request` event [#274](${url})

```
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Reading...
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Read complete after 1s
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Reading...
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Read complete after 2s
module.imagebuilder.data.aws_caller_identity.current: Reading...
module.imagebuilder.data.aws_imagebuilder_component.this["update-linux"]: Reading...
module.imagebuilder.data.aws_caller_identity.current: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Reading...
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["update-linux"]: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["stig_rhel6_ansible.yml.tftpl"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_distribution_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_recipe.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_pipeline.this: Refreshing state... [id=<REDACTED>]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.imagebuilder.aws_imagebuilder_component.this["stig_rhel6_ansible.yml.tftpl"] must be replaced
+/- resource "aws_imagebuilder_component" "this" {
      ~ arn                   = "arn:aws:imagebuilder:eu-west-2:374269020027:component/base-rhel-6-10-stig-rhel6-ansible/0.1.1/1" -> (known after apply)
      ~ data                  = <<-EOT # forces replacement
            ---
            name: base_rhel_6_10_stig_rhel6_ansible
            description: Install ansible roles for running stig_rhel6
            schemaVersion: 1.0
            parameters:
              - Version:
                  type: string
          -       default: 0.1.1
          +       default: 0.1.0
                  description: Uses the recipe version to avoid any issues with the branch template arg.
              - Platform:
                  type: string
                  default: "Linux"
                  description: Platform.
            phases:
              - name: build
                steps:
                  # Install ansible roles
                  - name: InstallAndRunAnsible
                    action: ExecuteBash
                    inputs:
                      commands:
                        - |
                          set -e
                          PATH=$PATH:/usr/local/bin
                          run_ansible() {
                            repo="modernisation-platform-ami-builds"
                            ami_tag="base_rhel_6_10"
            
                            # clone ansible roles and playbook
                            yum install -y git
                            ansible_dir=$(mktemp -d)
          -                 echo "Cloning $repo into $ansible_dir using branch=nomis/DSOS-1884/fix-rhel6-base-ami"
          +                 echo "Cloning $repo into $ansible_dir using branch=main"
                            cd $ansible_dir
          -                 git clone -b nomis/DSOS-1884/fix-rhel6-base-ami "https://github.com/ministryofjustice/$repo.git"
          +                 git clone -b main "https://github.com/ministryofjustice/$repo.git"
            
                            # set python version
                            if [[ $(which python3.9) ]]; then
                              python=$(which python3.9)
                            elif [[ $(which python3.6) ]]; then
                              python=$(which python3.6)
                            else
                              echo "Python3.9/3.6 not found"
                              exit 1
                            fi
                            echo "python: $python"
            
                            # install python dependencies outside of virtual env so ansible
                            # can be executed remotely
                            cd $ansible_dir/$repo/ansible
                            $python -m pip install -r requirements.txt
            
                            # activate virtual environment
                            mkdir $ansible_dir/python-venv && cd "$_"
                            $python -m venv ansible
                            source ansible/bin/activate
                            $python -m pip install --upgrade pip
                            if [[ "$python" =~ 3.6 ]]; then
                              $python -m pip install wheel
                              $python -m pip install cryptography==2.3
                              export LC_ALL=en_US.UTF-8
                              $python -m pip install ansible-core==2.11.12
                            else
                              $python -m pip install ansible==6.0.0
                            fi
            
                            # install requirements in virtual env
                            cd $ansible_dir/$repo/ansible
                            $python -m pip install -r requirements.txt
                            ansible-galaxy role install -r requirements.yml
                            ansible-galaxy collection install -r requirements.yml --force
            
                            # run ansible (note comma after localhost is deliberate)
                            ansible-playbook -v playbooks/stig_rhel6.yml \
                            --connection=local \
                            --inventory localhost, \
                            --extra-vars "ansible_python_interpreter=$python" \
                            --extra-vars "target=localhost" \
                            --tags "amibuild,prelim,cat1,cat2" \
                            --skip-tags "low,aide,sshd,selinux,V-38484,V-38497,V-38518,V-38519,V-38585,V-38623,V-51337" \
                            --become
            
                            # Cleanup
                            deactivate
                            echo "Cleaning up $ansible_dir"
                            rm -rf $ansible_dir/$repo
                            rm -rf $ansible_dir/python-venv
                            rmdir $ansible_dir
                          }
                          echo "stig_rhel6_ansible $ami_tag start" | logger -p local3.info -t ami-component
                          run_ansible 2>&1 | logger -p local3.info -t ami-component -s 2>&1
                          echo "stig_rhel6_ansible $ami_tag end" | logger -p local3.info -t ami-component
        EOT
      ~ date_created          = "2023-05-16T13:36:25.812Z" -> (known after apply)
      ~ encrypted             = true -> (known after apply)
      ~ id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/base-rhel-6-10-stig-rhel6-ansible/0.1.1/1" -> (known after apply)
        name                  = "base_rhel_6_10_stig_rhel6_ansible"
      ~ owner                 = "374269020027" -> (known after apply)
      - supported_os_versions = [] -> null
      ~ tags                  = {
          ~ "base_rhel_6_10_stig_rhel6_ansible-version" = "0.1.1" -> "0.1.0"
          ~ "branch"                                    = "nomis/DSOS-1884/fix-rhel6-base-ami" -> "main"
          ~ "image-recipe"                              = "base_rhel_6_10/0.1.1" -> "base_rhel_6_10/0.1.0"
          ~ "infrastructure-configuration"              = "base_rhel_6_10/0.1.1" -> "base_rhel_6_10/0.1.0"
          ~ "is-production"                             = "false" -> "true"
          ~ "release-or-patch"                          = "test" -> "n/a"
            # (7 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "base_rhel_6_10_stig_rhel6_ansible-version" = "0.1.1" -> "0.1.0"
          ~ "branch"                                    = "nomis/DSOS-1884/fix-rhel6-base-ami" -> "main"
          ~ "image-recipe"                              = "base_rhel_6_10/0.1.1" -> "base_rhel_6_10/0.1.0"
          ~ "infrastructure-configuration"              = "base_rhel_6_10/0.1.1" -> "base_rhel_6_10/0.1.0"
          ~ "is-production"                             = "false" -> "true"
          ~ "release-or-patch"                          = "test" -> "n/a"
            # (7 unchanged elements hidden)
        }
      ~ type                  = "BUILD" -> (known after apply)
      ~ version               = "0.1.1" -> "0.1.0" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_distribution_configuration.this will be updated in-place
  ~ resource "aws_imagebuilder_distribution_configuration" "this" {
        id           = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/base-rhel-6-10"
        name         = "base_rhel_6_10"
      ~ tags         = {
          ~ "base_rhel_6_10_stig_rhel6_ansible-version" = "0.1.1" -> "0.1.0"
          ~ "branch"                                    = "nomis/DSOS-1884/fix-rhel6-base-ami" -> "main"
          ~ "image-recipe"                              = "base_rhel_6_10/0.1.1" -> "base_rhel_6_10/0.1.0"
          ~ "infrastructure-configuration"              = "base_rhel_6_10/0.1.1" -> "base_rhel_6_10/0.1.0"
          ~ "is-production"                             = "false" -> "true"
          ~ "release-or-patch"                          = "test" -> "n/a"
            # (7 unchanged elements hidden)
        }
      ~ tags_all     = {
          ~ "base_rhel_6_10_stig_rhel6_ansible-version" = "0.1.1" -> "0.1.0"
          ~ "branch"                                    = "nomis/DSOS-1884/fix-rhel6-base-ami" -> "main"
          ~ "image-recipe"                              = "base_rhel_6_10/0.1.1" -> "base_rhel_6_10/0.1.0"
          ~ "infrastructure-configuration"              = "base_rhel_6_10/0.1.1" -> "base_rhel_6_10/0.1.0"
          ~ "is-production"                             = "false" -> "true"
          ~ "release-or-patch"                          = "test" -> "n/a"
            # (7 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      ~ distribution {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.imagebuilder.aws_imagebuilder_image_pipeline.this must be replaced
-/+ resource "aws_imagebuilder_image_pipeline" "this" {
      ~ arn                              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/base-rhel-6-10" -> (known after apply)
      ~ date_created                     = "2023-05-16T14:59:46.920Z" -> (known after apply)
      ~ date_last_run                    = "2023-06-02T16:10:22.043Z" -> (known after apply)
      ~ date_next_run                    = "2023-07-01T00:00:00.000Z" -> (known after apply)
      ~ date_updated                     = "2023-05-16T14:59:46.920Z" -> (known after apply)
      ~ id                               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/base-rhel-6-10" -> (known after apply)
      ~ image_recipe_arn                 = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/base-rhel-6-10/0.1.1" -> (known after apply) # forces replacement
      ~ infrastructure_configuration_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/base-rhel-6-10-0-1-1" -> (known after apply)
        name                             = "base_rhel_6_10"
      ~ platform                         = "Linux" -> (known after apply)
      ~ tags                             = {
          ~ "base_rhel_6_10_stig_rhel6_ansible-version" = "0.1.1" -> "0.1.0"
          ~ "branch"                                    = "nomis/DSOS-1884/fix-rhel6-base-ami" -> "main"
          ~ "image-recipe"                              = "base_rhel_6_10/0.1.1" -> "base_rhel_6_10/0.1.0"
          ~ "infrastructure-configuration"              = "base_rhel_6_10/0.1.1" -> "base_rhel_6_10/0.1.0"
          ~ "is-production"                             = "false" -> "true"
          ~ "release-or-patch"                          = "test" -> "n/a"
            # (7 unchanged elements hidden)
        }
      ~ tags_all                         = {
          ~ "base_rhel_6_10_stig_rhel6_ansible-version" = "0.1.1" -> "0.1.0"
          ~ "branch"                                    = "nomis/DSOS-1884/fix-rhel6-base-ami" -> "main"
          ~ "image-recipe"                              = "base_rhel_6_10/0.1.1" -> "base_rhel_6_10/0.1.0"
          ~ "infrastructure-configuration"              = "base_rhel_6_10/0.1.1" -> "base_rhel_6_10/0.1.0"
          ~ "is-production"                             = "false" -> "true"
          ~ "release-or-patch"                          = "test" -> "n/a"
            # (7 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      ~ schedule {
          + timezone                           = (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.imagebuilder.aws_imagebuilder_image_recipe.this must be replaced
+/- resource "aws_imagebuilder_image_recipe" "this" {
      ~ arn              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/base-rhel-6-10/0.1.1" -> (known after apply)
      ~ date_created     = "2023-05-16T14:59:45.979Z" -> (known after apply)
      ~ id               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/base-rhel-6-10/0.1.1" -> (known after apply)
        name             = "base_rhel_6_10"
      ~ owner            = "374269020027" -> (known after apply)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change.
      ~ parent_image     = (sensitive) # forces replacement
      ~ platform         = "Linux" -> (known after apply)
      ~ tags             = {
          ~ "base_rhel_6_10_stig_rhel6_ansible-version" = "0.1.1" -> "0.1.0"
          ~ "branch"                                    = "nomis/DSOS-1884/fix-rhel6-base-ami" -> "main"
          ~ "image-recipe"                              = "base_rhel_6_10/0.1.1" -> "base_rhel_6_10/0.1.0"
          ~ "infrastructure-configuration"              = "base_rhel_6_10/0.1.1" -> "base_rhel_6_10/0.1.0"
          ~ "is-production"                             = "false" -> "true"
          ~ "release-or-patch"                          = "test" -> "n/a"
            # (7 unchanged elements hidden)
        }
      ~ tags_all         = {
          ~ "base_rhel_6_10_stig_rhel6_ansible-version" = "0.1.1" -> "0.1.0"
          ~ "branch"                                    = "nomis/DSOS-1884/fix-rhel6-base-ami" -> "main"
          ~ "image-recipe"                              = "base_rhel_6_10/0.1.1" -> "base_rhel_6_10/0.1.0"
          ~ "infrastructure-configuration"              = "base_rhel_6_10/0.1.1" -> "base_rhel_6_10/0.1.0"
          ~ "is-production"                             = "false" -> "true"
          ~ "release-or-patch"                          = "test" -> "n/a"
            # (7 unchanged elements hidden)
        }
      ~ version          = "0.1.1" -> "0.1.0" # forces replacement
        # (2 unchanged attributes hidden)

      - block_device_mapping {
          - device_name = "/dev/sda1" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 30 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sda1"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 30
              + volume_type           = "gp3"
            }
        }

      ~ component {
          ~ component_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:component/base-rhel-6-10-stig-rhel6-ansible/0.1.1/1" -> (known after apply) # forces replacement
        }

        # (4 unchanged blocks hidden)
    }

  # module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this must be replaced
-/+ resource "aws_imagebuilder_infrastructure_configuration" "this" {
      ~ arn                           = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/base-rhel-6-10-0-1-1" -> (known after apply)
      ~ date_created                  = "2023-05-16T13:36:25.993Z" -> (known after apply)
      + date_updated                  = (known after apply)
      ~ id                            = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/base-rhel-6-10-0-1-1" -> (known after apply)
      ~ name                          = "base_rhel_6_10_0_1_1" -> "base_rhel_6_10_0_1_0" # forces replacement
      ~ resource_tags                 = {
          ~ "base_rhel_6_10_stig_rhel6_ansible-version" = "0.1.1" -> "0.1.0"
          ~ "branch"                                    = "nomis/DSOS-1884/fix-rhel6-base-ami" -> "main"
          ~ "image-recipe"                              = "base_rhel_6_10/0.1.1" -> "base_rhel_6_10/0.1.0"
          ~ "infrastructure-configuration"              = "base_rhel_6_10/0.1.1" -> "base_rhel_6_10/0.1.0"
          ~ "is-production"                             = "false" -> "true"
          ~ "release-or-patch"                          = "test" -> "n/a"
            # (7 unchanged elements hidden)
        }
      ~ tags                          = {
          ~ "base_rhel_6_10_stig_rhel6_ansible-version" = "0.1.1" -> "0.1.0"
          ~ "branch"                                    = "nomis/DSOS-1884/fix-rhel6-base-ami" -> "main"
          ~ "image-recipe"                              = "base_rhel_6_10/0.1.1" -> "base_rhel_6_10/0.1.0"
          ~ "infrastructure-configuration"              = "base_rhel_6_10/0.1.1" -> "base_rhel_6_10/0.1.0"
          ~ "is-production"                             = "false" -> "true"
          ~ "release-or-patch"                          = "test" -> "n/a"
            # (7 unchanged elements hidden)
        }
      ~ tags_all                      = {
          ~ "base_rhel_6_10_stig_rhel6_ansible-version" = "0.1.1" -> "0.1.0"
          ~ "branch"                                    = "nomis/DSOS-1884/fix-rhel6-base-ami" -> "main"
          ~ "image-recipe"                              = "base_rhel_6_10/0.1.1" -> "base_rhel_6_10/0.1.0"
          ~ "infrastructure-configuration"              = "base_rhel_6_10/0.1.1" -> "base_rhel_6_10/0.1.0"
          ~ "is-production"                             = "false" -> "true"
          ~ "release-or-patch"                          = "test" -> "n/a"
            # (7 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 4 to add, 1 to change, 4 to destroy.

```
